export const futureCollection = {
	name: "진로",
	img:"assets/logo/우석대학교.png",
	areas: [
	   {
		  name: "프로그래밍",
		  skills: [
			 {
				name: "앱 개발자",
				
				description: {
				   text: "앱 개발자의 업무는 기획, 제작, 유통으로 나눈다 “기획단계” 에서는 유사콘텐츠가 있는지, 고객요구사항이 뭔지, 사업 목표, 일정 계획 등의 사업 계획을 수립한다. “제작단계”에서는 사용 OS 별로 특성 파악 후 플랫폼을 정해 개발을 시작한다. 그래픽 디자이너와 수시로 의견 교환하고 기획의도에 맞는 콘텐츠를 제작한다. 제작된 콘텐츠는 사용자에게 전달되거나 오픈마켓에서 판매 유통된다. 그 이후에도 프로그램 업그레이드를 수행하기도 한다."
				}
			 },
			 {
				name: "웹 개발자",
				
				description: {
				   text: "웹 개발자는 월드 와이드웹(World Wide Web)을 위한 프로그램이나 어플리케이션을 만드는 프로그래머를 뜻한다. 웹 개발자는 어떻게 웹 사이트를 만드는지 하나부터 열까지 꿰뚫고 있습니다. 필요에 알맞은 커스텀코드를 만들고, 웹 사이트의 레이아웃부터 웹 페이지의 기능까지 모두 개발한다."
				}
			 },
			 {
				name: "게임 개발자",
			
				description: {
				   text: "게임 개발자는 컴퓨터 게임이나 비디오 게임을 만드는 개발자를 통칭하는 말이다.  1980년대까지만 해도 혼자 또는 소수의 인원이 게임을 제작하는 경우가 많았지만, 이후에는 인디 게임 MOD, 동인게임을 제외한 게임이 점차 복잡해지고 만들어야 할 양이 늘어나면서 점차 많은 사람들이 게임을 분업해서 제작하는 방향으로 흘러가게 되었다."
				}
			 },
			 {
				name: "DB 개발자",
			
				description: {
				   text: "방대한 데이터를 효율적으로 처리하고 관리 할수 있는 오라클(Oracle), MS-SQL 등의 툴을 이용하여 정형화된 데이터를 구축한 데이터베이스 관리시스템(DBMS)를 설계하고 개발 그리고 관리하는 직업이다."
				}
			 },    
			 {
				name: "네트워크 개발자",
			
				description: {
				   text: "네트워크를 구성하는 서버나 방화벽 등의 장비를 개발하거나 네트워크 프로토콜들을 이용해 응용프로그램을 개발하는 일을 하는사람을 뜻한다. 최근엔 더 광범위해져 장비들을 관리하거나 모니터링하는 하드웨어,소프트웨어 개발을 포함하기도 한다. 최근에는 네트워크 성능을 높이기 위한 튜닝을 일부 포함한다."
				}
			 },     
			 {
				name: "컴포넌트 개발자",
			
				description: {
				   text: "많은 하드웨어 제품들은 각각 독립된 기능을 가진 모듈로 만들어지며 이 제품들은 회사 상관없이 서로 조합하여 하나의 제품이 만들어진다. 이러한 제품들의 부품은 문제가 발생했을 시, 해당 부품만 다른 부품으로 바꾸어도 제품은 문제없이 작동한다. 반면에, 소프트웨에 에서는 상황이 틀리다소프트웨어를 독립적으로 개발되지 않은 경우가 많을 뿐더러, 독립적으로 개발되어도 다른 모듈과의 호환을 생각하지 않고 개발한다.  이는 결국 소프트웨어의 재사용을 어렵게 하고 유지보수 비용이 크게 증가하는 원인이 된다. 이러한 상황에서 소프트웨어의 재사용의 중요성 과 필용성을 위해 나온 기술을 만드는 사람을 컴포넌트 개발자 라고한다."
				}
			 },   
			  {
				name: "응용 프로그래머",
			
				description: {
				   text: "응용프로그램은 컴퓨터 시스템을 특정 응용분야에 사용하기 위해 제작된 소프트웨어를 말하는데 시스템 소프트웨어와의 상호작용을 통해 구현되는 프로그램을 말한다. 이런 응용프로그램을 운용하고 관리하는 관리자가 응용프로그래머이다. 주된 업무는 워드프로세서, 회계관리프로그램, 통계프로그램 이미지 편집 툴 등 학교, 가정, 회사에서 빠르고 효율적으로 일을 처리할 수 있도록 돕는 역할을 한다."
				}
			 },   
			 {
				name: "보안 프로그래머",
			
				description: {
				   text: "보안 프로그래머- 정보관리의 핵심기인 보안 분야의 솔루션·백신 제작을 담당하는 사람이다. 컴퓨터 바이러스 발생이나 해커의 침입에 대비해 방화벽을 구축하고 바이러스에 감염됐을 때 감염 경로나 원인을 찾아 문제를 해결하는 등의 일을 하기도 한다."
				}
			 },      
		  ]
	   },
	   {
        name: "시스템 서버",
        skills: [
          {
            name: "서버 엔지니어",
          
            description: {
               text: "프로그래머가 개발한 소프트웨어(혹은 서비스)가 동작할 수 있도록 기반 시스템(base system) 혹은 인프라 구조(infra structure)를 설계 및 구축하고 운영하며 문제를 파악하고 고치기도 하며, 때로는 하드웨어 뿐만 아니라 소프트웨어 오류 또한 관리하고 수정하기도 한다, 노후한 부분에 대한 보수 및 장비 교체 등을 주도하기도 한다 즉, 시스템이 최고의 성능을 발휘할수 잇도록 튜닝하는 역할을 한다."
            }
          },
          {
            name: "시스템 보안가",
           
            description: {
               text: "시스템의 계정과 권한 등의 보안 요소는 단순한 하나의 시스템에 해당할 수도 있지만 다양한 네트워크로 연결된 기업이나 국가의 시스템들이 점 하나가 될 수도, 시스템 보안은 권한 없는 사용자에 의한 파일, 폴더 및 장치 등의 사용을 제한하여 보호하는 시스템 기능을 제작하는 직업이다."
            }
          },
          {
            name: "서버 관리자",
         
            description: {
               text: "서버 설치, 운영, 유지하는 것부터 관리하고 보수하는 것까지 전체적으로 진행하는 직업이며 윈도우서버, 리눅스 서버 등 다양한 운영체제에 대한 지식이 요구된다."
            }
          },    
        ]
     },
     {
      name: "네트워크",
      skills: [
        {
          name: "네트워크 엔지니어",
        
          description: {
             text: "프로그래머가 개발한 소프트웨어(혹은 서비스)가 동작할 수 있도록 기반 시스템(base system) 혹은 인프라 구조(infra structure)를 설계 및 구축하고 운영하며 문제를 파악하고 고치기도 하며, 때로는 하드웨어 뿐만 아니라 소프트웨어 오류 또한 관리하고 수정하기도 한다, 노후한 부분에 대한 보수 및 장비 교체 등을 주도하기도 한다 즉, 시스템이 최고의 성능을 발휘할수 잇도록 튜닝하는 역할을 한다."
          }
        },
        {
          name: "네트워크 보안가",
         
          description: {
             text: "허가되지 않은 액세스와 피해로부터 회사의 네트워크를 보호하기 위해 설계된 일련의 전략,프로세스,기술을 개발하는 직업이다."
          }
        },
        {
          name: "네트워크 설계자",
       
          description: {
             text: "컴퓨터 또는 통신 네트워크의 설계를 담당하는 사람이다. 많은 네트워크 설계자가 실제로 설계 한 네트워크를 생성하지는 않지만 (네트워크 엔지니어의 역할 인) 때때로 현장에서 작업한다. 이는 같은 사람이 설계자 및 엔지니어링 작업을 수행하거나 작업이 특히 복잡한 소규모 회사에서 일반적이다. 대부분의 네트워크 아키텍트는 컴퓨터 네트워크를 설계하는 컴퓨터 분야에서 일하지만 일부는 통신, 전화 또는 케이블 시스템을 설계한다."
          }
        },    
      ]
   },
	  {
        name: "데이터베이스",
        skills: [
          {
            name: "DB",
           
            description: {
               text: "데이터베이스(DataBase)의 줄임말로 여러사람들이 공유하고 사용할 목적으로 통합관리되는 정보의 집합 그리고 논리적으로 영관된 하나 이상의 자료의 모음으로, 그내용을 구조화함으로써 검색과 갱신의 효율화를 꾀한 것을 말한다."
            }
          },
          {
            name: "DBA",
          
            description: {
               text: "위 DB를 즉, 다량의 정형데이터를 효율적으로 관리, 활용, 처리하기위해 ORACLE ? SQL, PL/SQL 등 툴을 사용하여 데이터베이스 관리 시스템인 DBMS를 구축 설계 관리하는 역할을 하는 데이터베이스 관리자(DataBase Administration)이다."
            }
          },
          {
            name: "DBMS 엔지니어",
           
            description: {
               text: "기업의 데이터베이스 솔루션에 장애가 생겼을 때 문제를 찾아내어 해결한다거나, 데이터베이스 플랫폼을 설치해주는 등과 같이 데이터베이스와 관련된 모든 일을 담당하는 직업이다."
            }
          },
          {
            name: "DA",
           
            description: {
               text: "Data architecture의 약자로 데이터 모델링을 비롯해 그보다 더 개괄적인 영역과 더 물리적인 영역까지도 모두 포함한 데이터에 관한 한 모든 구조를 체계화하는 것을 말한다."
            }
		  },      
		  {
            name: "모델러",
            
            description: {
               text: "게임 및 애니메이션에 들어갈 캐릭터나 배경 프롭들을 포토샵이나 3ds Max, 마야, Blender 등으로 작업하는 사람을 말한다."
            }
		  }, 
		  {
            name: "튜너",
            
            description: {
               text: "주로 무선수신 장치의 입력부에 사용되는 것으로 일정한 전파(또는 전기신호)의 주파수에 동조 하여 그 전파만을 선택하여 꺼내기 위한 것을 말한다."
			}
		},    
	  ]
	},

	  {
        name: "정보보안",
        skills: [
          {
            name: "모의 해킹 전문가",
         
            description: {
               text: "모의 해킹 전문가-  다양한 해킹툴을 사용해 실제 블랙해커처럼 사이트 및 서버를 해킹하고 성공할 시 그 부분에 대한 보안솔루션을 제시해준다. 악성코드를 넣어서 SW들을 마비 시키거나 제 기능을 수행하지 못하게 할 수도 있고 시스템을 마비시켜서 컴퓨터를 활용하지 못하게 하는 방식 등 다양한 해킹루트가 있기 때문에 그만큼 다양한 방식을 검토하고 활용할 수 있어야 한다."
            }
          },
          {
            name: "보안솔루션 개발자",
            
            description: {
               text: "보안솔루션 개발자- 정보보호 관련 사고를 미연에 방지하기 위해서 보안이 필요한 분야에서 요구되는 소프트웨어 프로그램을 개발하는 전문가를 말한다. 정보보호 산업의 동향을 파악하고, 고객이  요구하는 수준에 맞는 보안제품을 기획하며 기획에 따른 정보보호 제품을 설계와 동시에 암호화 알고리즘을 개발하고 외부로부터 불법침입을 탐지하기 위한 시스템과 방화벽, 백신을 개발하는 역할을 한다."
            }
          },
          {
            name: "악성코드 분석전문가",
           
            description: {
               text: "외부에서 침입하는 악성코드나 바이러스 등을 모니터링하며 대응,분석 등을 하여 Fresh 한 보안상태를 유지하는 일을 한다."
            }
          },
          {
            name: "침해 대응 전문가(CERT)",
            
            description: {
               text: "기본적으로 고객사의 Port 점검 및 주요 서비스 관련 URL 점검을 하는 모니터링 업무, 서비스 관련 모티터링 및 이벤트 점검을 하는 점검 업무, 서버 점검 및 로그 분석을 하는 분석업무, 장비점검 및 취약점 분석을 통한 해결 방안 제시를 하는 대응 업무, 보안교육 및 장기적 처리 능력을 배양하는 사후처리 업무를 한다."
            }
		  },  
		  {
            name: "보안관제 전문가",
            
            description: {
               text: "고객의 IT자산을 보안 관점에서 실시간 모니터링하고 대응하는 서비스를 만드는 직업이다."
            }
		  },
		  {
            name: "보안 컨설턴트",
            
            description: {
               text: "보안 컨설턴트의 주 업무는 보안 컨설팅을 하는 것이다. 컨설팅이란 특정 기업이 당면한 문제들을 분석하고 해결할 수 있도록 외부 조직 또는 업체, 컨설턴트가 도와주는 일을 말한다. 외부에서 성공하고 실패한 사례를 타 기업에 접목시켜 도와주며, 경영자가 추구하는 목표를 성취할 수 있도록 환경 여건을 제공하는 서비스를 말한다. 기존의 업무에서 벗어나서 특정 기업의 문제를 신기술로 해결하는 방안도 제시하는 역할을 합니다. 정보 보안 서비스를 다루는 정보 보호 컨설팅은 보안을 진단하고 해결 방법을 제시하는 서비스이다."
			}
		}
	 ]
  }
]
}


	  


	  