export const softwareCollection = {
	name: "충북대학교 소프트웨어학과 커리큘럼",
	img:"assets/logo/충북대학교.png",
	areas: [{
			name: "1학년",
			skills: [{
					name: "이산수학",
					necessary:true,
					grade:3,
					description: {
						text: "컴퓨터과학 및 디지털정보처리 분야의 수학적 기초가 되는 논리, 함수, 관계를 포함한 집합, 알고리즘, 수학적 귀납법 및 증명방법, 그래프, 트리, 부울 대수 등을 학습한다.",
						links: [

						]
					},
					skills: [{
						name: "알고리즘",
						necessary:true,
						grade:3,
						description: {
							text: "일반적으로 널리 알려진 알고리즘 및 대표적인 응용분야에 적용되는 알고리즘 기능 및 처리 과정을 배운다. 알고리즘의 난해도를 분석하고 효율적인 알고리즘을 설계하는 기법을 익힌다.",
							links: [

							]
						},
					}, ]

				},
				{
					name: "창의공학설계",
					grade:2,
					description: {
						text: "여러 가지 다양한 문제의 해결 과정을 통해서 참여 학생의 창의적 능력을 키우며, 문제의 해결에 대한 능력 향상과 함께 팀활동을 체험한다.",
						links: [

						]
					},
					skills: [{
						name: "산학프로젝트",
						necessary:true,
						grade:2,
						description: {
							text: "산업체(가족회사)의 멘토 또는 취업 선배(멘토)와의 연계를 통해 산업체가 수행하고 있는 프로젝트를 이해하고, 산업체에서 프로젝트 수행에 따른 문제점과 이에 대한 해결 방안을 멘토와 함께 해결함으로써, 현장의 실전을 이해한다",
							links: [

							]
						},
						skills: [{
							name: "캡스톤 디자인 I",
							necessary:true,
							grade:2,
							description: {
								text: "컴퓨터과학의 기본 이론을 바탕으로 팀을 구성하여 주제를 선정하고, 프로젝트 진행 방법을 계획하여, 최종 결과물을 도출하기까지의 프로세스를 체계적으로 준수하면서 팀 기반의 프로젝트 수행을 경험한다.",
								links: [
	
								]
							},
							skills: [{
								name: "캡스톤 디자인 II",
								necessary:true,
								grade:2,
								description: {
									text: "컴퓨터과학의 기본 이론을 바탕으로 팀을 구성하여 주제를 선정하고, 프로젝트 진행 방법을 계획하여, 최종 결과물을 도출하기까지의 프로세스를 체계적으로 준수하면서 팀 기반의 프로젝트 수행을 경험한다.",
									links: [
		
									]
								},
							}, ]
						}, ]
					}, ]
				},
				{
					name: "미래설계탐색",
					grade:1,
					description: {
						text: "스트롱 직업흥미검사를 온라인으로 실시하고, 해석 워크샵을 그 결과를 알게함으로써 자신의 직업적 흥미 경향성을 알아보고, 지속적인 상담 및 지도를 통해 자기를 이해하고 개인 가치관을 확립한다.",
						links: [

						]
					}
				},
				{
					name: "컴퓨터시스템개론",
					necessary:true,
					grade:3,
					description: {
						text: "컴퓨터에 대한 기초 지식을 부여하는 과목으로서 하드웨어, 소프트웨어 및 Firmware의 기능을 정의하고 프로그램과 컴퓨터 상호간에 관계 및 문제의 해결을 컴퓨터로 처리하는 방법을 습득한다.",
						links: [

						]
					},
					skills: [{
						name: "자료구조",
						necessary:true,
						grade:3,
						description: {
							text: "컴퓨터에서 처리하는 데이터 기본 개념과 이를 효율적으로 처리하기 위한 자료 구조인 Array, Stack, Queue 및 Linked List 등의 자료구조에 대하여 공부한다. 또는 이를 이용한 Tree Manipulation, 그래프 이론, 자료 정렬 및 검색과 Symbol Table 작성 방법에 대하여 학습한다.",
							links: [

							]
						},

						skills: [{
							name: "데이터베이스시스템",
							grade:3,
							description: {
								text: "이 과목에서는 데이터베이스의 기본 개념과 개체-관계(E-R) 다이어그램, 관계형 데이터 모델 및 SQL 문의 사용, 데이터베이스 설계, 데이터베이스 보안 등은 물론 DBMS 구조와 그 기능을 공부한다. 아울러 실제 응용에서 시스템 개발과 웹의 연동 방법 등을 학습한다.",
								links: [

								]
							},
							skills: [{
								name: "빅데이터시스템설계",
								grade:3,
								description: {
									text: "빅데이터시스템에서 데이터 전처리와 플랫폼, 그리고 정형 및 비정형의 빅데이터 수집, 저장, 분석과 탐색, 공유, 전파, 시각화, 질의, 갱신 등의 방법에 대한 이론과 실무를 학습한다. 또한 빅데이터시스템을 위한 동시성 제어와 회복기법, 보안정책을 학습한다.",
									links: [
	
									]
								},
							}, ]
						}, {
							name: "알고리즘",
							necessary:true,
							grade:3,
							description: {
								text: "일반적으로 널리 알려진 알고리즘 및 대표적인 응용분야에 적용되는 알고리즘 기능 및 처리 과정을 배운다. 알고리즘의 난해도를 분석하고 효율적인 알고리즘을 설계하는 기법을 익힌다.",
								links: [

								]
							},
						}, ]
					}, ]
				},
				{
					name: "오픈소스소프트웨어이해와실습",
					necessary:true,
					grade:2,
					description: {
						text: "IT분야에서 활발하게 사용되고 있는 오픈소스소프트웨어의 종류, 올바른 활용방법, 개발환경의 구성, 다양한 응용 등에 대해 학습하여 오픈소스소프트웨어에 대한 이해를 높이고 기본적인 활용방법을 배운다.",
						links: [

						]
					}
				},
				{
					name: "미래설계준비",
					grade:1,
					description: {
						text: "",
						links: [

						]
					}
				},
			]
		},
		{
			name: "2학년",
			skills: [
				{
					name: "컴퓨터구조",
					necessary:true,
					grade:3,
					description: {
						text: "컴퓨터 관련 전공자들이 필수적으로 알고 있어야 할 컴퓨터 하드웨어의 동작 원리에 대하여 학습한다. 컴퓨터의 구성 요소인 중앙처리장치, 기억장치, 입출력장치의 동작 원리를 이해하고, 중앙처리장치가 명령어를 실행하는 과정에 대하여 자세히 배운다.",
						links: [

						]
					},
					skills: [{
						name: "펌웨어프로그래밍",
						grade:3,
						description: {
							text: "마이크로컴퓨터 시스템의 하드웨어 구성 요소를 이해하고, 마이크로프로세서 실습 장비를 사용하여 하드웨어를 제어하기 위한 시스템 시작 코드 해석, 인터럽트 및 타이머 제어 프로그래밍, 입출력 디바이스 제어를 위한 펌웨어 프로그래밍 기술을 습득한다.",
							links: [

							]
						},
					},{
						name: "운영체제",
						necessary:true,
						grade:3,
						description: {
							text: "운영체제, 특히 다중 프로그래밍 시분할 시스템, 비동기 병행프로세서의 기본개념을 다룬다. 스케쥴링, 메모리 관리 정보의 고유 및 보호 등의 개념을 습득한다.",
							links: [

							]
						},
					}, ]
				},
				{
					name: "소프트웨어실전영어",
					grade:2,
					description: {
						text: "본 수업은 소프트웨어 개발자들의 다양한 업무에서 요구되는 영어 능력 향상을 위해 다양한 관련 상황을 통해 영어를 학습해나간다. 학생들은 소프트웨어 개발자로써 필요한 영어 능력들, 예를 들어 코드 분석 문서, 버그 리포팅, 이메일, 이력서 등을 영어로 작성함으로써 실제 문법과 쓰기를 배우고, 이들을 영어로 발표하거나 실제 인터뷰를 진행하는 등의 방식으로 실질적인 영어 학습의 기회를 얻는다.",
						links: [

						]
					}
				},
				{
					name: "객체지향 프로그래밍",
					grade:3,
					description: {
						text: "객체지향 개념 및 프로그래밍 기법에 대한 이론적 학습과 실습을 통하여 객체지향 프로그램을 개발하고, 실제 응용 프로그래밍에 활용할 수 있는 능력을 함양한다.",
						links: [

						]
					},
					skills: [{
						name: "객체지향설계",
						necessary:true,
						grade:3,
						description: {
							text: "객체지향 개발 방법에 의하여 소프트웨어를 분석하고 설계하기 위한 기본 개념의 이해 및 기법들을 대하여 학습하고, 프로젝트를 통한 문제 분석 및 설계 과정을 진행한다.",
							links: [

							]
						},
						skills: [{
							name: "소프트웨어공학",
							necessary:true,
							grade:3,
							description: {
								text: "소프트웨어 공학에 대한 기본적인 개념의 이해와 소프트웨어 개발 과정에서 품질을 향상시키기 위해 요구되는 공학적 활동에 대하여 학습하고, 주어진 문제의 소프트웨어 개발을 위한 프로젝트를 진행한다.",
								links: [

								]
							},
						}, ]
					}, ]
				},
				{
					name: "선형대수학",
					grade:3,
					description: {
						text: "행렬과 연립방정식, 행렬식, 벡터공간, 선형변환, 고유값, 특이값 분해 등의 이해를 통해 전산 응용 수학의 기초지식을 습득한다.",
						links: [

						]
					}
				},
				{
					name: "미래설계구현",
					grade:1,
					description: {
						text: "",
						links: [

						]
					}
				},
				{
					name: "오픈소스 기초프로젝트",
					grade:2,
					description: {
						text: "오픈 소스 프로그래밍 언어인 자바를 이용하여 실생활에 적용 가능한 소프트웨어를 개발하고, 이러한 개발과정에서 프로그램의 역할과 프로그램 코드의 체계적인 개발에 대한 중요성을 이해한다.",
						links: [

						]
					}
				},

				{
					name: "프로그래밍언어론",
					grade:3,
					description: {
						text: "이 과목은 컴퓨터 프로그래밍 언어에 적용되고 있는 기본 개념에 대해서 학습하고 최신 프로그래밍 언어가 가지고 있는 특징을 개괄한다. 이를 통하여 사용할 프로그램 언어를 선택할 수 있는 능력을 배양하고 프로그램 언어의 설계 능력을 갖추도록 한다.",
						links: [

						]
					}
				},
				{
					name: "시스템프로그래밍",
					grade:3,
					description: {
						text: "컴퓨터 시스템의 효율적인 사용이 요구되는 하드웨어와 소프트웨어 구조의 이해, Assembly Language 이해를 통해 Assembler, Loader 등의 설계방법 도입",
						links: [

						]
					}
				},
				{
					name: "창업탐색",
					grade:1,
					description: {
						text: "4차 산업 혁명과 관련된 기술 동향을 파악하고 창업 과정에 필요한 기본 지식을 습득한다. 초청 강연과 창업에 관한 다양한 활동를 통하여 전공 역량을 강화하고 도전 의식을 함양한다.",
						links: [

						]
					}
				},
				{
					name: "오픈소스개발프로젝트",
					grade:2,
					description: {
						text: "오픈 소스 프로그래밍 언어인 자바를 이용하여 실생활에 적용 가능한 소프트웨어를 개발하고, 이러한 개발과정에서 프로그램의 역할과 프로그램 코드의 체계적인 개발에 대한 중요성을 이해한다.",
						links: [

						]
					}
				},
				{
					name: "확률및통계",
					grade:3,
					description: {
						text: "통계적 개념과 통계적 사고방법의 도입을 통해 전자계산기 시스템 분야에서의 응용 능력 배양",
						links: [

						]
					}
				},
				{
					name: "컴퓨터그래픽스",
					grade:3,
					description: {
						text: "컴퓨터 그래픽스 분야를 구성하는 렌더링, 애니메이션, 그리고 기하모델링 등의 기본 주제에 관한 이론과 실제를 다루며 대표적인 실시간 3차원 그래픽스 프로그래밍 툴을 사용하여 그래픽스 프로그래밍 기법을 익힌다.",
						links: [

						]
					}
				},
			]
		},
		{
			name: "3학년",
			skills: [
				{
					name: "오픈소스 웹소프트웨어",
					grade:3,
					description: {
						text: "",
						links: [

						]
					}
				},
				{
					name: "컴파일러",
					grade:3,
					description: {
						text: "최신 컴파일러를 중심으로 어휘분석, 파싱 및 코드생성 등 일련의 컴파일 과정을 학습한다. 특히 컴퓨터 프로그래밍 언어가 가지고 있는 다양한 특징들을 컴파일 단계에서 어떻게 구현되는 가를 학습한다.",
						links: [

						]
					}
				},
				{
					name: "컴퓨터네트워크",
					grade:3,
					description: {
						text: "네트워크의 기본 개념과 네트워크의 구조, TCP/IP 프로토콜 구조, 네트워크, 전송 및 응용 계층 프로토콜들에 관련한 기술 및 원리에 대해 인터넷을 중심으로 학습한다.",
						links: [

						]
					}
				},
				{
					name: "창업기획",
					grade:1,
					description: {
						text: "4차 산업 혁명과 관련된 기술 동향을 파악하고 창업에 관련된 전문 역량을 키운다. 초청강연과 창업에 관한 다양한 활동를 통하여 전공 역량을 강화하고 도전 의식을 함양한다.",
						links: [

						]
					}
				},
				{
					name: "오픈소스전문프로젝트",
					grade:2,
					description: {
						text: "소프트웨어 개발이 단순한 코딩 작업만이 아니라, 분석 및 설계 과정을 거쳐 개발되어야 함을 이해하고, 오픈 소스 툴을 사용하여 웹과 앱에서 실행되는 어플리케이션을 개발하는 기술을 학습한다.",
						links: [

						]
					}
				},

				{
					name: "창업 설계",
					grade:1,
					description: {
						text: "4차 산업 혁명과 관련된 기술 동향을 파악하고 창업에 관련된 실무 경험을 수행한다. 초청 강연과 창업에 관한 다양한 활동를 통하여 전공 역량을 강화하고 도전 의식을 함양한다.",
						links: [

						]
					}
				},
				{
					name: "정보보호",
					grade:3,
					description: {
						text: "정보보호 기초 이론 학습과 네트워크 보안 및 시스템 보안의 기본 개념을 이해하고 안전한 정보 시스템 구축 및 안전한 네트워크 서비스를 제공할 수 있는 방법을 습득한다.",
						links: [

						]
					}
				},
				{
					name: "인공지능",
					grade:3,
					description: {
						text: "인공지능의 성공적인 적용분야 및 목표를 살펴보고, 대표적인 지능적인 문제 해결 기법들, 지식표현 방법 및 추론, 지식기반 시스템, 자연어처리, 컴퓨터 비전, 지능로봇 등에 대해서 학습한다.",
						links: [

						]
					}
				},
			]
		},
		{
			name: "4학년",
			skills: [{
					name: "인턴십 I",
					grade:3,
					description: {
						text: "학교에서 습득한 전공기술을 산업현장 기술과의 접목을 통하여 현장적응 능력을 배양하고 대학과 지역 산업체간의 유기적인 산학협동 관계를 정립한다.",
						links: [

						]
					}
				},
				{
					name: "인턴십 IV",
					grade:15,
					description: {
						text: "학교에서 습득한 전공기술을 산업현장 기술과의 접목을 통하여 현장적응 능력을 배양하고 대학과 지역 산업체간의 유기적인 산학협동 관계를 정립한다.",
						links: [

						]
					}
				},
				{
					name: "실무프로젝트 I",
					grade:3,
					description: {
						text: "설계 프로젝트 수행 경험을 바탕으로 보다 실질적이고 실무 중심적 과제 수행의 관점에서 학습자 주도적으로 학습을 진행한다. 이를 위하여 적용 현장의 특성 분석을 바탕으로 IT 최신 기술의 사용 능력과 실무 현장에서의 요구사항분석, 다양한 소프트웨어 설게 방법론의 활용과 프로젝트 관리 능력 배양의 관점에서 과제를 수행한다.",
						links: [

						]
					}
				},
				{
					name: "기계학습",
					grade:3,
					description: {
						text: "데이터로부터 패턴을 추천하는 기계학습에 대한 핵심적인 원리를 소개한다. 지도학습, 비지도학습, 강화학습의 기본 개념을 소개하며, 주요 기계학습 알고리즘과 딥러닝 기법을 다룬다.",
						links: [

						]
					}
				},
				{
					name: "임베디드시스템",
					grade:3,
					description: {
						text: "ARM기반 임베디드 시스템의 구조 및 시스템 소프트웨어 동작에 대해 학습하고, 리눅스 포팅, 부트로더, 디바이스 드라이버 작성 등의 실습 프로젝트를 수행한다.",
						links: [

						]
					}
				},
				{
					name: "영상처리",
					grade:3,
					description: {
						text: "디지털 영상처리에 대한 기본적인 지식과 함께 관련 분야에의 응용에 대한 기술을 심화한다. 그리고 최근의 영상처리이론과 연구결과를 접함으로써 선진 기술들에 대한 이해의 폭을 넓힌다.",
						links: [

						]
					}
				},
				{
					name: "창업산학세미나 I",
					grade:1,
					description: {
						text: "산업체와 학교의 교류를 통한 기업가정신, 최신 IT기술 동향 및 산업체의 경영철학과 경영방법을 습득한다.",
						links: [

						]
					}
				},
				{
					name: "컴퓨터교재연구 및 지도법",
					grade:3,
					description: {
						text: "컴퓨터 교과지도에 필요한 능력을 배양하고 컴퓨터와 그 응용에 관하여 지식을 습득하게 하며 기초적인 프로그래밍 실무를 익힐 수 있는 교재를 연구한다.",
						links: [

						]
					}
				},
				{
					name: "인턴십 II",
					grade:15,
					description: {
						text: "학교에서 습득한 전공기술을 산업현장 기술과의 접목을 통하여 현장적응 능력을 배양하고 대학과 지역 산업체간의 유기적인 산학협동 관계를 정립한다.",
						links: [

						]
					}
				},
				{
					name: "인턴십 III",
					grade:3,
					description: {
						text: "학교에서 습득한 전공기술을 산업현장 기술과의 접목을 통하여 현장적응 능력을 배양하고 대학과 지역 산업체간의 유기적인 산학협동 관계를 정립한다.",
						links: [

						]
					}
				},
				{
					name: "실무프로젝트 III",
					grade:6,
					description: {
						text: "설계 프로젝트 수행 경험을 바탕으로 보다 실질적이고 실무 중심적 과제 수행의 관점에서 학습자 주도적으로 학습을 진행한다. 이를 위하여 적용 현장의 특성 분석을 바탕으로 IT 최신 기술의 사용 능력과 실무 현장에서의 요구사항분석, 다양한 소프트웨어 설게 방법론의 활용과 프로젝트 관리 능력 배양의 관점에서 과제를 수행한다.",
						links: [

						]
					}
				},
				{
					name: "창업파일럿프로젝트",
					grade:2,
					description: {
						text: "",
						links: [

						]
					}
				},
				{
					name: "정보검색",
					grade:3,
					description: {
						text: "정보 표현 및 저장 방법, 문헌 질의와 매칭과정, 텍스트 분석, 정보검색 검색효과 측정, 효과성 향상기법 등을 포함한 대량 정보의 조직적인 저장, 관리, 검색, 마이닝 기법에 대한 이론과 방법을 학습한다.",
						links: [

						]
					}
				},
				{
					name: "창업산학세미나 II",
					grade:1,
					description: {
						text: "산업체와 학교의 교류를 통한 기업가 정신, 최신 IT기술 동향 및 산업체의 경영철학과 경영방법을 습득한다.",
						links: [

						]
					}
				},
				{
					name: "컴퓨터논리 및 논술",
					grade:3,
					description: {
						text: "컴퓨터 교과를 중심으로 학생의 새로운 창조적 아이디어로 표현하고, 아이디어의 타당성과 정당성을 체계적으로 전개하는 능력을 함양하도록 한다. 아울러 컴퓨터 논리에 대한 관련 자료의 탐색을 수행하여 그 결과를 정리하고 발표 및 토론하는 방식으로 중등 교육 현장에서 수요자 중심교육을 실시할 수 있도록 한다. 궁극적으로 컴퓨터 교과 교사로서의 기본 자질인 스스로 문제를 해결할 수 있는 창조적 사고력을 기반으로 지식사회가 필요로 하는 논리적 사고 능력을 습득한다.",
						links: [

						]
					}
				},
				{
					name: "컴퓨터교육론",
					grade:3,
					description: {
						text: "컴퓨터에 관한 교육과 컴퓨터를 이용한 교육의 이론과 실제를 학습한다. 컴퓨터 교과의 역사적 배경, 컴퓨터 교과교육의 목표, 중·고등학교 교육과정의 분석 등 중등과정의 정보·컴퓨터 교육의 전반에 관하여 학습한다.",
						links: [

						]
					}
				},
				{
					name: "자연어 처리",
					grade:3,
					description: {
						text: "사람이 사용하는 언어를 컴퓨터가 이해하여 지능적으로 처리하기 위한 다양한 알고리즘을 학습한다. 특히 웹 등에서 비정형 데이터로 존재하는 자연언어 텍스트를 처리하기 위해 단어 패턴 추출, 텍스트 정규화, 품사 태깅, 의미 모호성 해소, 부분 파싱, 개체명 인식, 관계 추출, 문서 분류 등에 대해 학습하고 이를 구현 및 활용하는 방법을 익힌다.",
						links: [

						]
					}
				},
				{
					name: "빅데이터분석시각화",
					grade:3,
					description: {
						text: "이 강좌에서 수집된 데이터를 보다 쉽게 이해할 수 있도록 시각화는 대표적인 방법을 공부한다. 공부할 시각화 기법으로는 시간 시각화, 연계 시각화, 비교시각화, 분포시각화, 공간시각화 등이 있다. 머신 러닝 기법을 이용한 데이터 분석 결과를 보다 쉽게 볼 수 있는 시각화 기법도 소개한다.",
						links: [

						]
					}
				},
				{
					name: "클라우드컴퓨팅",
					grade:3,
					description: {
						text: "본 수업은 클라우드에 대한 상세한 개념과 IaaS, PaaS, SaaS, BPaaS과 같은 다양한 클라우드 서비스 모델에 대해 다룬다. 학생들은 Amazon Elastic Cloud, Microsoft’s Azure, Google App Engine을 활용한 프로젝트를 통해서 실질적인 경험을 얻을 수 있다.",
						links: [

						]
					}
				},
			]
		}
	]
};